data/collected_data/orange/api/standarda2v2/h/load_compose.txt
Running 30m test @ http://20.108.188.234:60/wrk2-api/post/compose
  2 threads and 1000 connections
  Thread calibration: mean lat.: 4774.627ms, rate sampling interval: 15818ms
  Thread calibration: mean lat.: 4524.924ms, rate sampling interval: 15826ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.66m     4.95m   22.61m    65.48%
    Req/Sec    10.92      9.90    29.00     57.14%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.36m 
 75.000%   11.10m 
 90.000%   13.62m 
 99.000%   22.61m 
 99.900%   25.95m 
 99.990%   27.58m 
 99.999%   28.17m 
100.000%   28.17m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    6160.383     0.000000            1         1.00
   82313.215     0.100000         4046         1.11
  166985.727     0.200000         8096         1.25
  259260.415     0.300000        12141         1.43
  352845.823     0.400000        16198         1.67
  441450.495     0.500000        20233         2.00
  487587.839     0.550000        22263         2.22
  534249.471     0.600000        24291         2.50
  581435.391     0.650000        26314         2.86
  622854.143     0.700000        28332         3.33
  665845.759     0.750000        30361         4.00
  686817.279     0.775000        31358         4.44
  709885.951     0.800000        32385         5.00
  731381.759     0.825000        33381         5.71
  757596.159     0.850000        34400         6.67
  783810.559     0.875000        35402         8.00
  799539.199     0.887500        35916         8.89
  817364.991     0.900000        36430        10.00
  836763.647     0.912500        36921        11.43
  858783.743     0.925000        37429        13.33
  886046.719     0.937500        37943        16.00
  901775.359     0.943750        38187        17.78
  925368.319     0.950000        38437        20.00
  962068.479     0.956250        38689        22.86
 1012924.415     0.962500        38944        26.67
 1093664.767     0.968750        39201        32.00
 1132462.079     0.971875        39323        35.56
 1170210.815     0.975000        39449        40.00
 1205862.399     0.978125        39575        45.71
 1245708.287     0.981250        39702        53.33
 1276116.991     0.984375        39828        64.00
 1294991.359     0.985938        39892        71.11
 1313865.727     0.987500        39956        80.00
 1340080.127     0.989062        40017        91.43
 1362100.223     0.990625        40082       106.67
 1383071.743     0.992188        40144       128.00
 1398800.383     0.992969        40179       142.22
 1409286.143     0.993750        40214       160.00
 1417674.751     0.994531        40239       182.86
 1429209.087     0.995313        40270       213.33
 1448083.455     0.996094        40301       256.00
 1459617.791     0.996484        40317       284.44
 1472200.703     0.996875        40334       320.00
 1486880.767     0.997266        40350       365.71
 1498415.103     0.997656        40366       426.67
 1507852.287     0.998047        40381       512.00
 1515192.319     0.998242        40388       568.89
 1522532.351     0.998437        40396       640.00
 1531969.535     0.998633        40404       731.43
 1541406.719     0.998828        40413       853.33
 1558183.935     0.999023        40420      1024.00
 1564475.391     0.999121        40424      1137.78
 1574961.151     0.999219        40432      1280.00
 1574961.151     0.999316        40432      1462.86
 1585446.911     0.999414        40437      1706.67
 1591738.367     0.999512        40441      2048.00
 1593835.519     0.999561        40442      2275.56
 1600126.975     0.999609        40444      2560.00
 1605369.855     0.999658        40446      2925.71
 1617952.767     0.999707        40448      3413.33
 1625292.799     0.999756        40450      4096.00
 1632632.831     0.999780        40451      4551.11
 1634729.983     0.999805        40452      5120.00
 1644167.167     0.999829        40454      5851.43
 1644167.167     0.999854        40454      6826.67
 1654652.927     0.999878        40455      8192.00
 1654652.927     0.999890        40455      9102.22
 1665138.687     0.999902        40456     10240.00
 1665138.687     0.999915        40456     11702.86
 1671430.143     0.999927        40457     13653.33
 1671430.143     0.999939        40457     16384.00
 1671430.143     0.999945        40457     18204.44
 1681915.903     0.999951        40458     20480.00
 1681915.903     0.999957        40458     23405.71
 1681915.903     0.999963        40458     27306.67
 1681915.903     0.999969        40458     32768.00
 1681915.903     0.999973        40458     36408.89
 1690304.511     0.999976        40459     40960.00
 1690304.511     1.000000        40459          inf
#[Mean    =   459845.387, StdDeviation   =   297251.800]
#[Max     =  1689255.936, Total count    =        40459]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  40968 requests in 30.02m, 7.73MB read
  Socket errors: connect 0, read 12651, write 1428749, timeout 192750
  Non-2xx or 3xx responses: 500
Requests/sec:     22.74
Transfer/sec:      4.40KB